Revit 2027 API
SpatialElementCalculationLocation.MarkerPosition Property
 The position of the spatial element calculation location marker.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ MarkerPosition { get; }
Public ReadOnly Property MarkerPosition As XYZ
	Get
public:
property XYZ^ MarkerPosition {
	XYZ^ get ();
}
member MarkerPosition : XYZ with get
Property Value
XYZ
See Also
Reference
SpatialElementCalculationLocation Class
Autodesk.Revit.DB Namespace